       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GREETING PIC X(12) VALUE 'SHALOM'.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY GREETING.
           MOVE 'DONE' TO GREETING.
           STOP RUN.
