       IDENTIFICATION DIVISION.
       PROGRAM-ID. WITHCOPY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CUSTOMER.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE 1 TO CUST-ID.
           DISPLAY CUST-NAME.
           STOP RUN.
